/*
 *  연산자
 *  38page => 산술연산자
 *  41page => 증감연산자
 *  44page => 비교연산자
 *  45page => 논리연산자
 *  48page => 조건연산자(삼항연산자)
 *  => 대입연산자
 *  --------------------------------
 *  자바에서 지원하는 연산자
 *  ----------------------------------
 *  1. 단항연산자
 *  	= 증감연산자 (++, --) => 한개증가, 한개 감소시에 사용
 *  						=> 주로 사용처는 반복문에(for,while,do~while)
 *      1) 전치 연산자: 먼저 증가한 후에 다른 연산자를 수행 - ++a
 *      2) 후치 연산자: 다른 연산자를 수행 나중에 증가한다 - a++
 *  	
 *    한개 증가/ 한개 감소
 *    a++,++a,a=a+1,a+=1
 *    a--,--a,a=a-1,a-=1 ========> byte,short,int,long,float,double,char
 *    
 *     =부정 연산자 (!) ==> boolean
 *     true=> !true = false
 *     ! = 반대효과를 준다
 *      !(a<10)  ///== 이 부호가 아닐시 표시
 *      
 *     = 형변환 연산자 (데이터형)
 *      = 자동 형변환
 *      -> 작은 데이터형이 큰데이터형에 대입
 *      -> 연산처리시
 *      = 강제 형변환
 *      int a=(int)10.5; // 큰데이터형이 작은 데이터형에 들어갔기 때문에 (int) 처리
 *     
 *  	
 *  ----------------------------------
 *  2. 이항연산자
 *  =산술연산자 (+, -, *, /, %)
 *  =비교연산자 (==,!=,<,>,<=,>=)
 *  =논리연산자 (&&,||)
 *  =대입연산자 (=,+=,-=)
 *  ----------------------------------
 *  3. 삼항연산자
 *  =조건?값:값
 *  ----------------------------------
 */
public class 연산자정리 {

	public static void main(String[] args) {
//		// TODO Auto-generated method stub
//		char c='A';
//		//System.out.println(c++);
//		System.out.println(++c);
//		double d=10.0;
//		d++;
//		System.out.println(d);
		
		
	    
		
		
		
		
	}

}
