package com.sist.exam;
/*
 * 1. 1
 * 2. 2
 * 3. 1
 * 4. 4
 * 5. Parent 클래스를 상속한 Child 클래스의 생성자에서 컴파일 에러가 발생한 이유는?
 *    생성자는 상속이 되지 않는다, 기본 생성자가 없다
 * 6. 2  
 * 7. 3
 * 8. 4
   9-1. 4
   9-2. 3
   9-3. 2
   9-4. 3
   9-5. 4
   9-6. 다중상속, 단일상속, 모든 메소드 변수 =>public
        인터페이스 = 여러개의 클래스를 모아서 관리
   9-7. 
   9-8. 인터페이스 장점 = 표준화가 가능하다, 서로 다른 클래스 연결,
        독립적으로 사용, 개발시간 단축
        =리모콘 (기능은 없지만 연결이 가능)
     9. e (패키지 연결은 import)
    10. d   생성자의 역할
             = 객체 생성시에 호출(생성자는 반드시 한 개 이상이 필요하다)
             = 멤버변수에 대한 초기화 
             = 클래스명과 동일 / 리터형이 없다 / 접근지정어는 보통 public
             = 오버로딩을 지원한다( 여러 개 생성자가 있을 수 있다)
             = 초기화
                1) 명시적 초기화
                2) 구현후에 초기화값 대입 => 파일읽기,제어문,데이터베이스
                   초기화 블록
                   생성자 == 주로 사용빈도가 많다
    11. b
    12. c
    13. 
    14.   
    15. c
    16.implement A
    17.
    18. 오버로딩 오버라이딩
         
             

 */
public class 문제풀이 {
	

}
